TRANSLATIONS = {
    "en_US": [
    """=== RULES ===
--- Main menu ---
    In the main menu You'll see two buttons:
    1. Choose - choose a level.
    2. Shop - show the shop.
--- Shop ---
    1. In the shop You'll see your points and maximum amount of attempts.
    2. If You have enough points to buy attempts You will see buttons to buy one attempt (the price will change every time You buy an attempt, the price is in points).
--- Points ---
    1. You earn points when You pass a level. If the level is 11 You will earn 11 points, if the level is 15 You will earn 15 points, etc.
    2. By default You have  10 points.
--- Attempts ---
    1. You can buy attempts in the shop.
    2. By default You have 3 attempts.
--- Levels ---
    1. You can select a level in the main menu.
    2. There isn't a maximum level (there is infinity of levels).

DON'T CHANGE, RENAME OR DELETE FILES IN THIS GAME'S FOLDER. OTHERWISE THE GAME WON'T WORK.
""",
        "I've read all rules and I agree with them",
        "Shop",
        "Your points",
        "Your attempts",
        "Main screen",
        "Go back",
        "You don't have enough points to buy attempts",
        "Select",
        "Enter a level: ",
        "Level",
        "Buy +1 attempt (cost: {} {})",
        "points",
        "point",
        "points",
        "Check",
        "Enter a correct number: ",
        "Enter a correct level: ",
        "You have {} more {}. Enter a number (from 1 to {}): ",
        "attempts",
        "attempt",
        "attempts",
        "You have {} more {}. ",
        "Try bigger",
        "Try less", "Yes",
        "Next number",
        """You've lost. Your winning streak: {} {}.
Your longest winning streak: {} {}""",
        "wins",
        "win",
        "wins",
        "Restart",
        "BONUS!!! YOU HAVE 50 MORE SCORE!!!"
        ],

    "uk_UA": [
       """=== ПРАВИЛА ===
--- Головне меню ---
    На головному меню є дві кнопки:
    1. Обрати - обрати рівень.
    2. Магазин - показати магазин.
--- Магазин ---
    1. У магазині Ви побачите свої бали та максимальну кількість спроб.
    2. Якщо у Вас достатньо балів для покупки спроб, Ви побачите кнопки для покупки однієї спроби (ціна змінюватиметься щоразу, коли Ви купуєте спробу, ціна у балах).
--- Бали ---
    1. Ви заробляєте бали, коли проходите рівень. Якщо рівень 11, Ви отримаєте 11 балів, якщо рівень 15, Ви отримаєте 15 балів і т. д.
    2. За замовчуванням у Вас 10 балів.
--- Спроби ---
    1. Ви можете купити спроби в магазині.
    2. За замовчуванням у Вас є 3 спроби.
--- Рівні ---
    1. Ви можете обрати рівень у головному меню.
    2. Максимального рівня немає (існує нескінченність рівнів).

НЕ ЗМІНЮЙТЕ, НЕ ПЕРЕЙМЕНОВУЙТЕ ТА НЕ ВИДАЛЯЙТЕ ФАЙЛИ В ПАПЦІ З ЦІЄЮ ГРОЮ, ІНАКШЕ ГРА НЕ БУДЕ ПРАЦЮВАТИ.
""",
        "Я прочитав правила і погоджуюся з ними",
        "Магазин",
        "Кількість балів",
        "Кількість спроб",
        "Головне меню",
        "Назад",
        "Ви не маєте достатньо балів, щоб купити спроби",
        "Обрати",
        "Введіть рівень: ",
        "Рівень",
        "Купити +1 спробу (ціна: {} {})",
        "балів",
        "бал",
        "бала",
        "Перевірити",
        "Введіть коректне число: ",
        "Введіть коректний рівень: ",
        "У Вас залишилося {} {}. Введіть число (від 1 до {}): ",
        "спроб",
        "спроба",
        "спроби",
        "У Вас залишилося {} {}. ",
        "Спробуйте більше",
        "Спробуйте менше",
        "Правильно",
        "Наступне число",
        """Ви не вгадали. Ваша серія перемог: {} {}.
Ваша найдовша серія перемог: {} {}""",
        "перемог",
        "перемога",
        "перемоги",
        "Зіграти ще раз",
        "БОНУС!!! +50 БАЛІВ!!!"
    ],
    "ru_RU": [
        """=== ПРАВИЛА ===
--- Главное меню ---
     На главном меню есть две кнопки:
     1. Выбрать - выбрать уровень.
     2. Магазин - показать магазин.
--- Магазин ---
     1. В магазине вы увидите свои баллы и максимальное количество попыток.
     2. Если у Вас достаточно баллов для покупки попыток, Вы увидите кнопки для покупки одной попытки (цена будет меняться каждый раз, когда Вы приобретаете попытку, цена в баллах).
--- Баллы ---
     1. Вы зарабатываете баллы, когда проходите уровень. Если уровень 11, вы получите 11 баллов, если уровень 15, вы получите 15 баллов и т.д.
     2. По умолчанию у Вас 10 баллов.
--- Попытки ---
     1. Вы можете купить пробы в магазине.
     2. По умолчанию у Вас есть 3 попытки.
--- Уровни ---
     1. Вы можете выбрать уровень в главном меню.
     2. Максимального уровня нет (существует бесконечность уровней).

НЕ МЕНЯЙТЕ, НЕ ПЕРЕИМЕНЯЙТЕ И НЕ УДАЛЯЙТЕ ФАЙЛЫ В ПАПЯТКЕ С ЭТОЙ ИГРОЮ, ИНАЧЕ ИГРА НЕ БУДЕТ РАБОТАТЬ.
""",
         "Я прочитал правила и соглашаюсь с ними",
         "Магазин",
         "Количество баллов",
         "Количество попыток",
         "Главное меню",
         "Назад",
         "У вас недостаточно баллов, чтобы купить попытки",
         "Выбрать",
         "Введите уровень: ",
         "Уровень",
         "Купить +1 попытку (цена: {} {})",
         "баллов",
         "балл",
         "балла",
         "Проверить",
         "Введите корректное число: ",
         "Введите корректный уровень:",
         "У Вас осталось {} {}. Введите число (от 1 до {}): ",
         "проб",
         "проба",
         "пробы",
         "У Вас осталось {} {}.",
         "Попробуйте больше",
         "Попробуйте меньше",
         "Правильно",
         "Следующее число",
         """Вы не угадали. Ваша серия побед: {} {}.
Ваша самая длинная серия побед: {} {}""",
         "побед",
         "победа",
         "победы",
         "Сыграть еще раз",
        "БОНУС!!! +50 БАЛЛОВ!!!"
    ]
}

SECRET_KEY = b'L0KXR0rbh_WXsKyacENgkx_IL2-D_l3kx9R7qJZZvXw='